{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
  "@odata.type": "#microsoft.graph.iosManagedAppProtection",
  "displayName": "iOS MAM Policy",
  "description": "iOS MAM Policy (copy from production CliffordChance policy)",
  "createdDateTime": "2020-05-04T15:29:23.534533Z",
  "lastModifiedDateTime": "2025-10-11T22:30:33Z",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "T_3f43ad81-1dc6-424c-a342-9b8698d4d25a",
  "version": "\"4703267e-0000-0c00-0000-68eada890000\"",
  "periodOfflineBeforeAccessCheck": "P2D",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "allowedInboundDataTransferSources": "allApps",
  "allowedOutboundDataTransferDestinations": "managedApps",
  "organizationalCredentialsRequired": false,
  "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
  "dataBackupBlocked": false,
  "deviceComplianceRequired": true,
  "managedBrowserToOpenLinksRequired": true,
  "saveAsBlocked": false,
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "pinRequired": true,
  "maximumPinRetries": 8,
  "simplePinBlocked": false,
  "minimumPinLength": 6,
  "pinCharacterSet": "numeric",
  "periodBeforePinReset": "P90D",
  "allowedDataStorageLocations": [
    "oneDriveForBusiness",
    "sharePoint"
  ],
  "contactSyncBlocked": false,
  "printBlocked": true,
  "fingerprintBlocked": false,
  "disableAppPinIfDevicePinIsSet": true,
  "maximumRequiredOsVersion": null,
  "maximumWarningOsVersion": null,
  "maximumWipeOsVersion": null,
  "minimumRequiredOsVersion": null,
  "minimumWarningOsVersion": null,
  "minimumRequiredAppVersion": null,
  "minimumWarningAppVersion": null,
  "minimumWipeOsVersion": null,
  "minimumWipeAppVersion": null,
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "pinRequiredInsteadOfBiometricTimeout": "PT12H",
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "notificationRestriction": "allow",
  "previousPinBlockCount": 0,
  "managedBrowser": "microsoftEdge",
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "mobileThreatDefenseRemediationAction": "block",
  "mobileThreatDefensePartnerPriority": null,
  "blockDataIngestionIntoOrganizationDocuments": false,
  "allowedDataIngestionLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "camera"
  ],
  "appActionIfUnableToAuthenticateUser": "block",
  "dialerRestrictionLevel": "allApps",
  "gracePeriodToBlockAppsDuringOffClockHours": null,
  "protectedMessagingRedirectAppType": "anyApp",
  "isAssigned": true,
  "targetedAppManagementLevels": "unspecified",
  "appGroupType": "selectedPublicApps",
  "genmojiConfigurationState": null,
  "screenCaptureConfigurationState": null,
  "writingToolsConfigurationState": null,
  "appDataEncryptionType": "whenDeviceLocked",
  "minimumRequiredSdkVersion": null,
  "deployedAppCount": 133,
  "faceIdBlocked": false,
  "allowWidgetContentSync": true,
  "minimumWipeSdkVersion": null,
  "allowedIosDeviceModels": null,
  "appActionIfIosDeviceModelNotAllowed": "block",
  "appActionIfAccountIsClockedOut": null,
  "thirdPartyKeyboardsBlocked": false,
  "filterOpenInToOnlyManagedApps": false,
  "disableProtectionOfManagedOutboundOpenInData": true,
  "protectInboundDataFromUnknownSources": true,
  "customBrowserProtocol": "",
  "customDialerAppProtocol": "",
  "managedUniversalLinks": [
    "http://*.sharepoint.com/*",
    "http://*.sharepoint-df.com/*",
    "http://*.yammer.com/*",
    "http://*.onedrive.com/*",
    "http://tasks.office.com/*",
    "http://to-do.microsoft.com/sharing*",
    "http://web.microsoftstream.com/video/*",
    "http://msit.microsoftstream.com/video/*",
    "http://*.powerbi.com/*",
    "http://app.powerbi.cn/*",
    "http://app.powerbigov.us/*",
    "http://app.powerbi.de/*",
    "http://*.service-now.com/*",
    "http://*.appsplatform.us/*",
    "http://*.powerapps.cn/*",
    "http://*.powerapps.com/*",
    "http://*.powerapps.us/*",
    "http://*teams.microsoft.com/l/*",
    "http://*devspaces.skype.com/l/*",
    "http://*teams.live.com/l/*",
    "http://*collab.apps.mil/l/*",
    "http://*teams.microsoft.us/l/*",
    "http://*teams-fl.microsoft.com/l/*",
    "http://*.zoom.us/*",
    "http://zoom.us/*",
    "https://*.sharepoint.com/*",
    "https://*.sharepoint-df.com/*",
    "https://*.yammer.com/*",
    "https://*.onedrive.com/*",
    "https://tasks.office.com/*",
    "https://to-do.microsoft.com/sharing*",
    "https://web.microsoftstream.com/video/*",
    "https://msit.microsoftstream.com/video/*",
    "https://*.powerbi.com/*",
    "https://app.powerbi.cn/*",
    "https://app.powerbigov.us/*",
    "https://app.powerbi.de/*",
    "https://*.service-now.com/*",
    "https://*.appsplatform.us/*",
    "https://*.powerapps.cn/*",
    "https://*.powerapps.com/*",
    "https://*.powerapps.us/*",
    "https://*teams.microsoft.com/l/*",
    "https://*devspaces.skype.com/l/*",
    "https://*teams.live.com/l/*",
    "https://*collab.apps.mil/l/*",
    "https://*teams.microsoft.us/l/*",
    "https://*teams-fl.microsoft.com/l/*",
    "https://*.zoom.us/*",
    "https://zoom.us/*"
  ],
  "exemptedUniversalLinks": [
    "http://maps.apple.com",
    "https://maps.apple.com",
    "http://facetime.apple.com",
    "https://facetime.apple.com"
  ],
  "minimumWarningSdkVersion": null,
  "messagingRedirectAppUrlScheme": null,
  "exemptedAppProtocols": [
    {
      "name": "Default",
      "value": "tel;telprompt;skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
    }
  ]
}
