{
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "dcf4a2bc-4df7-473e-9c23-acb9e7f8c991",
  "createdDateTime": "2025-10-06T15:18:48.0676919Z",
  "description": "Updated Operating System Device Compliance Policy on 11-10-2025 08:35:11",
  "lastModifiedDateTime": "2025-10-11T20:35:12.2247853Z",
  "displayName": "DevOps Test for Matt iOS compliance ",
  "version": 29,
  "passcodeBlockSimple": false,
  "passcodeExpirationDays": null,
  "passcodeMinimumLength": 4,
  "passcodeMinutesOfInactivityBeforeLock": null,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
  "passcodePreviousPasscodeBlockCount": null,
  "passcodeMinimumCharacterSetCount": 0,
  "passcodeRequiredType": "numeric",
  "passcodeRequired": true,
  "osMinimumVersion": "26.0.1",
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "securityBlockJailbrokenDevices": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "restrictedApps": []
}
